{
  "Rensselaer Polytechnic Institute": {
    "bg_color": "#d6001c",
    "color": "#ffffff",
    "image": "img/rpi.png",
    "time": "Sep '22 - Present",
    "desc": null,
    "website": "https://www.rpi.edu/",
    "positions": [
      {
        "title": "Undergraduate Research Assistant",
        "time": "Sep '22 - Present",
        "desc_list": [
          {
            "items": [
              "Converting subproblem solutions from \"Canonical Subproblems for Robot Inverse Kinematics\" to C++ with PhD student Alex Elias",
              "Testing subproblem efficiency with bench‑marking and testing subproblem efficacy with various robots on campus"
            ]
          }
        ]
      }
    ]
  },
  "Rensselaer Motorsport": {
    "bg_color": "#ffffff",
    "color": "#b2282e",
    "image": "img/rm-modified.png",
    "time": "Mar '22 - Present",
    "desc": null,
    "website": "http://www.formularpi.org/",
    "positions": [
      {
        "title": "Powertrain Lead",
        "time": "Jun '22 - Present",
        "desc_list": [
          {
            "title": "Work on motor control/powertrain electronics and software for Rensselaer Motorsport's transition to EV",
            "items": [
              "Leading development of RM’s first electric powertrain: EMRAX 228 motor with a Cascadia RMS PM100DX motor controller",
              "Developing open and closed loop control systems (Traction Control, Launch Control, Regen Braking) that increase driver control",
              "Using a Kanban board to assign tasks to and using Slack to communicate with several team members under my leadership",
              "Setting up and hosting Webex meetings with several subsystems to develop a high-performance car that meets competition regulations"
            ]
          }
        ]
      },
      {
        "title": "Full Time Member (Software Electrical Engineer)",
        "time": "Mar '22 - Present",
        "desc_list": [
          {
            "items": [
              "Designed wireless telemetry and strain gauge systems to analyze the forces on suspension and help optimize our physics models",
              "Researched MoTeC CAN bus protocol to implement CAN communication for Arduino boards in the strain gauge system"
            ]
          }
        ]
      }
    ]
  },
  "RPI Robotics": {
    "bg_color": "#696969",
    "color": "#ffffff",
    "image": "img/rpi_robotics.png",
    "time": "Aug '21 - Present",
    "desc": null,
    "website": "https://sites.ecse.rpi.edu/roboticsclub/",
    "positions": [
      {
        "title": "Vice President",
        "time": "Dec '22 - Present",
        "desc_list": [
          {
            "items": [
              "Shifting all projects to new Agile development model: decreases production time, encourages design iteration, and increases project quality",
              "Promoting asynchronous meetings for project groups to improve productivity through individual work followed by check-up meetings",
              "Personalizing communication with each project lead to develop closer bonds and trust: chats become more productive and informative",
              "Acquiring building display approval from RPI Engineering Administration for display of Robotic Art Installation project (RAI) on Campus",
              "Developing control software using knowledge from Embedded Control about linear control theory for the array of origami units in RAI"
            ]
          }
        ]
      },
      {
        "title": "Media & PR Lead",
        "time": "Apr '22 - Dec '22",
        "desc_list": [
          {
            "items": [
              "Implemented ROS2 system for Laser Tag Robots project (iRobot Create3 Roombas that play laser tag)",
              "Restarted RPI Robotics with fellow Officers after a 1.5 year hiatus period: helped increase club size and presence on campus"
            ]
          }
        ]
      },
      {
        "title": "Software Engineer",
        "time": "Aug '21 - Present",
        "desc_list": [
          {
            "title": "Working on various software projects utilizing ROS and ROS2",
            "items": [
              "Laser Tag Roombas",
              "Inverse Kinematics with Stretch RE1"
            ]
          }
        ]
      }
    ]
  },
  "FRC 2601 - Steel Hawks": {
    "bg_color": "#C41818",
    "color": "#ffffff",
    "image": "img/steelhawks.svg",
    "time": "Sep '17 - Jul '21",
    "desc": null,    
    "website": "https://steelhawks.net/#/",
    "positions": [
      {
        "title": "Vice President of Fabrication and Software Engineering",
        "time": "Jul '20 - Jun '21",
        "desc_list": [
          {
            "title": "Initiated and led several team-wide projects",
            "items": [
              "ML-CV (Machine Learning - Computer Vision): Detects game pieces and special field markings from the 2021 FRC game \"Infinite Recharge.\" Target data is relayed to robot and driver, with 120 reads per second from a dual camera system. A hybrid Machine Learning-based and Filter & Mask-based system is used to detect the game pieces and field markings, with each system nullifying the weakness of the opposing system. This led to an increase in accuracy and reliability in comparison to Hawkeye (2020 Computer Vision System). The system is written in Python using Websocket, OpenCV, Tornado, and TensorFlow libraries, and uses a Jetson Nano with a Google Coral chip for processing and web-server hosting.",
              "PTO (Power Take-Off Gearbox): Designed and assembled a Power Take-Off Gearbox with Power Shuttle for the robot's drivetrain. Allows the power from the drivetrain to be redirected to or shared with another subsystem on the robot, while having the ability to instantaneously reverse output power for the auxiliary system without changing drivetrain direction.",
              "Telescoping Climber: Helped a teammate design a telescoping climber prototype for the robot. The telescoping climber utilized a steel tape system to extend and retract the climbing mechanism, keeping the subsystem compact and low-maintenance.",
              "Hawk Talks: Planned the team's annual Hawk Talk, where we hold around a dozen presentations discussing various aspects of running a First Robotics Competition team."
            ]
          },
          {
            "title": "Led several team-wide projects",
            "items": [
              "Upgrade to team's Scouting Application: After our Scouting App. team proposed the idea to add a dark mode to the app's UI, I helped them overcome various barriers that stumped their progress.",
              "Hawk Tank: Assisted groups in the mechanical subteam who participated in the team's Shark Tank spinoff."
            ]
          },
          {
            "title": "Initiated and led coding training for the 2021 FRC season",
            "items": [
              "Designed a team-wide calendar and outline for teaching incoming rookies."
            ]
          }
        ]
      },
      {
        "title": "Lead Software Engineer",
        "time": "Jul '19 - Jun '20",
        "desc_list": [
          {
            "title": "Initiated and led several coding projects",
            "items": [
              "RUT (Robot Utility Tools): a suite of development tools and libraries for making writing robot code easier.",
              "Hawkeye Computer Vision System: Detects game pieces and special field markings from the 2020 FRC game \"Infinite Recharge.\" Target data is relayed to robot and driver, with 120 reads per second from a dual camera system. The system is written in Python using Websocket, OpenCV, and Tornado libraries, and uses a Jetson Nano for processing and web-server hosting.",
              "PathCorder Autonomous System: Records driving paths and replays them with programmable interjections for intaking, shooting, etc. during the autonomous period of the 2020 FRC game \"Infinite Recharge.\" The system is written in Java using custom Algorithms to record and replay driver input with programmed interventions."
            ]
          },
          {
            "title": "Led rookie coding training for the 2020 FRC season",
            "items": [
              "Designed lessons and hands-on activities with fellow teammates for rookie members entering software engineering."
            ]
          }
        ]
      },
      {
        "title": "Software Engineer",
        "time": "Sep '17 - Jun '19",
        "desc_list": [
          {
            "title": "Worked on various technologies for robot control systems, computer vision systems, and for data gathering and analytics",
            "items": [
              "2018 and 2019 robot control systems",
              "2018 and 2019 computer vision systems",
              "2018 scouting application"
            ]
          }
        ]
      }
    ]
  },
  "TA PC Repair": {
    "bg_color": "#008AD8",
    "color": "#f5f7fa",
    "time": "Jun '18 - Aug '18",
    "desc": null,
    "positions": [
      {
        "title": "Computer Repair Technician",
        "time": "Jun '18 - Aug '18",
        "desc_list": [
          {
            "items": [
              "Worked on various software and hardware repairs.",
              "Worked on various hardware upgrades for machines.",
              "Built personal machines and company machines for clients.",
              "Supported outreach efforts to educate people on basic computer software tools."
            ]
          }
        ]
      }
    ]
  }
}