{
  "SwerveWorks Athena Platform (SWAP)": {
    "4_letter": "SW AP",
    "img": "img/projects/swerveworks/swerveworks.png",
    "description": "Developing an omni-directional, modular robotics platform for research and development in autonomous systems. The SWAP platform integrates advanced sensor suites, real-time control algorithms, and robust mechanical design to facilitate experimentation in navigation, mapping, and multi-robot coordination for autonomous logistics.",
    "time": "May '25 - WIP",
    "media": {
      "images": [
        "img/projects/swerveworks/swap_modules.jpeg"
      ],
      "videos": [],
      "websites": [
        {
          "url": "https://cad.onshape.com/documents/1c24afc6d49adfdb2d6464ea/w/a45358d55c625e73594d82c9/e/2e059c446f9177cf54d490c0?renderMode=0&uiState=68e5c67b6f1582ca5cf60fdb",
          "title": "SWAP CAD Model",
          "preview": "img/projects/swerveworks/swerveworks.png"
        },
        {
          "url": "https://github.com/RensselaerMotorsport/VehicleControlUnit",
          "title": "SWAP Software Repository",
          "preview": "img/projects/vcu/shabbyHILsetup.jpg"
        }
      ]
    },
    "tags": [
      "Robotics",
      "Embedded Systems",
      "C",
      "Mechanical Engineering"
    ],
    "modal": {
      "detailed_description": "SWAP is a dual module differential swerve platform designed for advanced robotics research and development. Each module features independent drive and steering capabilities, allowing for omni-directional movement and precise control of the chassis. The platform is equipped with a comprehensive sensor suite including RPLidar C1 LIDAR, an IMU, and cameras routed to a Nvidia Jetson Nano to support autonomous navigation and mapping tasks. The mechanical design emphasizes modularity and ease of maintenance, while the embedded systems architecture supports real-time control and data processing.",
      "context": {
        "type": "robotics",
        "title": "Advanced Robotics Innovation",
        "content": "SWAP is a cutting-edge robotics platform that redefines the capabilities of autonomous systems. By integrating advanced sensor technologies, real-time processing, and modular design, SWAP enables unprecedented experimentation in robotic navigation, mapping, and multi-agent coordination."
      },
      "technical_details": [
        {
          "icon": "🛞",
          "title": "Differential Swerve Module Design",
          "content": "Each module provides independent drive and steering, enabling true omni-directional movement and agile maneuvering. The modular mechanical design allows for rapid maintenance and reconfiguration."
        },
        {
          "icon": "🧭",
          "title": "Advanced Sensor Suite Integration",
          "content": "Equipped with RPLidar C1 LIDAR, IMU, and multiple cameras, all interfaced with a Jetson Nano for real-time SLAM, navigation, and perception tasks."
        },
        {
          "icon": "⚡",
          "title": "Real-Time Embedded Control",
          "content": "Custom embedded firmware in C manages low-level motor control, sensor fusion, and CAN bus communication, supporting high-frequency feedback loops for precise motion and data acquisition."
        }
      ],
      "impact": [
        {
          "icon": "🔬",
          "title": "Research Platform Enablement",
          "content": "Provides a robust, flexible testbed for autonomous navigation, mapping, and multi-robot coordination experiments in logistics and robotics research."
        },
        {
          "icon": "🧩",
          "title": "Modularity and Scalability",
          "content": "Mechanical and electrical modularity allows for rapid prototyping, easy upgrades, and adaptation to a wide range of research scenarios."
        },
        {
          "icon": "🤖",
          "title": "Advancement of Autonomous Systems",
          "content": "Accelerates development and validation of advanced algorithms in SLAM, path planning, and distributed robotics, supporting both academic and industrial innovation."
        }
      ],
      "challenges": [
        {
          "title": "Sensor Fusion and Real-Time Processing",
          "description": "Integrating data from LIDAR, IMU, and cameras in real-time for accurate localization and mapping under computational constraints."
        },
        {
          "title": "Robust Embedded Systems Design",
          "description": "Ensuring reliable, low-latency control and communication across distributed modules and sensors, with fault tolerance and maintainability."
        },
        {
          "title": "Mechanical-Electrical Integration",
          "description": "Balancing modularity, durability, and performance in a compact platform while supporting rapid maintenance and expansion."
        }
      ],
      "skills_gained": [
        "Real-time embedded systems programming",
        "CAN bus protocols and networking",
        "Advanced control systems design and implementation",
        "Sensor fusion and SLAM",
        "Mechanical and electrical modular design",
        "Hardware-software integration testing",
        "Autonomous robotics research methodologies"
      ]
    }
  },
  "Rensselaer Motorsport - Vehicle Control Unit": {
    "4_letter": "RM VCU",
    "img": "img/projects/rm_holder.jpg",
    "description": "Developing a custom Vehicle Control Unit (VCU) for Rensselaer Motorsport's RM27 Formula SAE car, now based on the STM32F767Zi microcontroller. The VCU implements real-time datalogging, control, and simulation systems, with a robust safety architecture and modular task scheduler. Leading a team at Rensselaer's Center for Open Source to deliver both hardware and software, including FreeRTOS-based firmware, CAN bus networking, and extensive unit testing.",
    "time": "May '23 - WIP",
    "media": {
      "images": [
        "img/projects/vcu/shabbyHILsetup.jpg",
        "img/projects/vcu/CubeMXpic1.png",
        "img/projects/vcu/CubeMXpic2.png"
      ],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/RensselaerMotorsport/VehicleControlUnit",
          "title": "VCU Software Repository",
          "preview": "img/projects/rm_holder.jpg"
        },
        {
          "url": "https://rensselaermotorsport.github.io/VehicleControlUnit/files.html",
          "title": "VCU Doxygen Documentation",
          "preview": "img/projects/vcu/doxygen.png"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Automotive",
      "Embedded Systems",
      "STM32"
    ],
    "modal": {
      "detailed_description": "Leading the design and implementation of a next-generation Vehicle Control Unit (VCU) for Formula SAE, built on the STM32F767Zi microcontroller. The VCU features a modular, real-time architecture using FreeRTOS, supporting datalogging, control, and simulation for all major vehicle systems. The software is structured around a scheduler and updateable task model, with strict safety validation for all control actions. The platform is highly configurable for use as a central VCU, CAN node, or datalogger, and is supported by custom hardware (KiCAD), HAL drivers, and comprehensive documentation.",
      "context": {
        "type": "motorsport",
        "title": "Formula SAE Embedded Systems Innovation",
        "content": "This project advances Formula SAE vehicle electronics by introducing a robust, modular VCU platform on STM32. The system is designed for reliability, safety, and extensibility, supporting rapid development and deployment of new vehicle features, and enabling advanced testing and simulation workflows."
      },
      "technical_details": [
        {
          "icon": "⚡",
          "title": "STM32F767Zi Real-Time Architecture",
          "content": "Implements a FreeRTOS-based scheduler for real-time task management, supporting sub-millisecond control loops, safety monitoring, and deterministic system updates. Modular Updateable classes allow for flexible expansion of sensors, controllers, and outputs."
        },
        {
          "icon": "🛠️",
          "title": "Safety-First Control Systems",
          "content": "All controllers are validated by monitor routines before actuating outputs, ensuring fail-safe operation. The architecture supports rapid disabling, safety checks, and redundancy for critical vehicle functions."
        },
        {
          "icon": "🚌",
          "title": "CAN Bus & Hardware Integration",
          "content": "Custom PCB design with KiCAD, STM32 HAL drivers, and robust CAN bus communication for reliable data exchange with inverters, BMS, and other subsystems. Designed for electromagnetic compatibility and harsh automotive environments."
        },
        {
          "icon": "🧪",
          "title": "Comprehensive Testing & Simulation",
          "content": "Supports SIL (Software-In-Loop), HIL (Hardware-In-Loop), and PIL (Processor-In-Loop) testing. Includes unit tests, simulation models, and documentation for rapid validation and debugging."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "Embedded Systems Leadership",
          "content": "Establishes a reusable, extensible VCU platform for current and future Formula SAE vehicles, accelerating development and improving reliability."
        },
        {
          "icon": "👥",
          "title": "Team & Open Source Collaboration",
          "content": "Leads a multidisciplinary team and open source contributors, producing public documentation and code for the broader motorsport and embedded systems community."
        },
        {
          "icon": "🏆",
          "title": "Competition-Ready Reliability",
          "content": "Delivers a robust, safety-validated control platform that meets the demanding requirements of Formula SAE competition."
        }
      ],
      "challenges": [
        {
          "title": "Real-Time Scheduling & Safety",
          "description": "Ensuring all control and safety tasks execute within strict timing constraints, with reliable failover and monitoring. Implemented priority-based task scheduling using FreeRTOS, added watchdog timers and redundant safety checks, and designed modular safety monitors for critical control paths."
        },
        {
          "title": "Hardware-Software Co-Design",
          "description": "Coordinating PCB, firmware, and system architecture to maximize reliability, maintainability, and performance on STM32. Iterated hardware and firmware design in parallel with regular integration tests, used custom hardware abstraction layers (HAL) for portability between STM chips, and documented interfaces with version control for both hardware and software."
        },
        {
          "title": "Testing Across Environments",
          "description": "Supporting seamless SIL, HIL, and PIL testing to validate firmware before deployment on real vehicles. Developed simulation models for all hardware interfaces, automated test suites for SIL, HIL, and PIL workflows, and used continuous integration pipelines to run tests on every code change."
        }
      ],
      "skills_gained": [
        "STM32 embedded firmware development",
        "FreeRTOS real-time task scheduling",
        "CAN bus protocol and automotive networking",
        "Safety-critical system design and validation",
        "Hardware-software integration (KiCAD, HAL)",
        "Unit testing and simulation for embedded systems",
        "Technical leadership and open source collaboration"
      ]
    }
  },
  "Multi-Robot Coordination System": {
    "4_letter": "MRCS",
    "img": "img/projects/multirobot/simulation.png",
    "description": "Advanced multi-robot coordination system implementing SLAM, ArUco marker detection, and Weighted Conflict-Based Search (WCBS) for collision-free path planning. Features real-time LiDAR simulation, occupancy grid mapping, and coordinated navigation for up to six robots in shared environments.",
    "time": "Mar '25 - Apr '25",
    "media": {
      "images": [
        "img/projects/multirobot/simulation.png"
      ],
      "videos": [
        {
          "url": "https://drive.google.com/file/d/1-SBP6zZVlUvf8kbpI0DZmbQDgqVu7UfT/view?resourcekey",
          "title": "WCBS Multi-Robot Simulation",
          "preview": "img/projects/multirobot/simulation2.png"
        }
      ],
      "websites": [
        {
          "url": "https://github.com/AmarMaksumic/MultiRobotSim",
          "title": "Multi-Robot Simulation Repository",
          "preview": "img/projects/multirobot/aruco_detection.png"
        },
        {
          "url": "https://www.linkedin.com/in/maksua/details/projects/1759899684409/single-media-viewer/?profileId=ACoAACwClcMB6GXAd_uAfyf9qoVC0ed8yXhg8mU",
          "title": "Project LinkedIn Post",
          "preview": "img/projects/multirobot/lidar_scan.png"
        }
      ]
    },
    "tags": [
      "Robotics",
      "SLAM",
      "Path Planning",
      "Computer Vision",
      "Multi-Agent Systems"
    ],
    "modal": {
      "detailed_description": "Comprehensive multi-robot coordination system designed for autonomous navigation in shared environments. The system integrates SLAM (Simultaneous Localization and Mapping), ArUco marker-based visual guidance, and advanced path planning algorithms to enable safe, coordinated movement of multiple robots. Built using NumPy and PyGame for real-time simulation, the project demonstrates sophisticated robotics concepts including sensor fusion, occupancy grid mapping, and conflict-free multi-agent path planning using Weighted Conflict-Based Search (WCBS).",
      "context": {
        "type": "academic",
        "title": "ECSE 6490: Robotics II Final Project",
        "content": "This capstone project for RPI's advanced Robotics course addresses fundamental challenges in multi-robot systems including coordination, collision avoidance, and real-time navigation. The work demonstrates mastery of SLAM algorithms, computer vision techniques, and advanced path planning methods essential for modern autonomous robotics applications in warehouses, hospitals, and collaborative workspaces."
      },
      "technical_details": [
        {
          "icon": "🗺️",
          "title": "Real-Time SLAM Implementation",
          "content": "Developed lightweight occupancy grid SLAM using LiDAR ray-casting simulation with Gaussian blur filtering and decay mechanisms. Implements both real-time mapping for immediate path planning and ICP-based offline SLAM using Open3D for high-precision global maps with point cloud alignment and drift correction."
        },
        {
          "icon": "🎯",
          "title": "ArUco Marker Visual Guidance",
          "content": "Integrated OpenCV-based ArUco marker detection with ROS messaging for robust robot localization and target assignment. Implemented transform frame management, marker dictionary systems, and broadcasting capabilities enabling marker-based navigation and human-robot interaction scenarios."
        },
        {
          "icon": "🤖",
          "title": "Weighted Conflict-Based Search (WCBS)",
          "content": "Advanced multi-robot path planning using WCBS algorithm with reservation tables managing space-time constraints. Implements safety margins, collision buffers (9-cell radius), and temporal reservations enabling coordinated navigation of up to six robots without deadlocks or collisions."
        },
        {
          "icon": "📡",
          "title": "LiDAR Simulation & Sensor Fusion",
          "content": "High-fidelity LiDAR simulation using 360-degree ray-marching with distance-dependent noise modeling. Generates point clouds for SLAM processing with configurable range (10m), resolution (1000x1000 grid), and realistic sensor characteristics matching commercial spinning LiDAR systems."
        }
      ],
      "impact": [
        {
          "icon": "🏭",
          "title": "Multi-Robot Coordination Advancement",
          "content": "Successfully demonstrated collision-free coordination of six robots in shared workspace, addressing critical challenges in warehouse automation, collaborative robotics, and autonomous logistics applications where multiple agents must operate safely in confined spaces."
        },
        {
          "icon": "🔬",
          "title": "SLAM & Navigation Integration",
          "content": "Created comprehensive robotics framework combining real-time mapping, visual guidance, and coordinated planning that serves as foundation for advanced autonomous systems research and practical multi-robot deployments."
        },
        {
          "icon": "📚",
          "title": "Educational & Research Platform",
          "content": "Developed complete simulation environment with real-time visualization enabling further research in multi-agent systems, human-robot interaction, and autonomous navigation algorithms."
        }
      ],
      "challenges": [
        {
          "title": "Multi-Robot Deadlock Prevention",
          "description": "Addressed complex coordination challenges where independent A* planning caused frequent collisions and deadlocks. Successfully implemented WCBS with space-time reservation tables, safety margins, and temporal constraints to enable smooth multi-robot navigation without conflicts."
        },
        {
          "title": "Real-Time SLAM Performance",
          "description": "Balanced mapping accuracy with computational efficiency for real-time operation. Developed lightweight occupancy grid approach with Gaussian filtering and decay mechanisms, plus high-precision ICP-based offline SLAM for comprehensive environment reconstruction."
        },
        {
          "title": "Sensor Integration & Simulation Fidelity",
          "description": "Created realistic sensor simulation including LiDAR ray-casting, distance-dependent noise modeling, and ArUco marker detection. Integrated multiple sensor modalities while maintaining real-time performance and accurate environmental representation."
        }
      ],
      "skills_gained": [
        "Advanced SLAM algorithm implementation and optimization",
        "Multi-robot coordination and conflict resolution",
        "Computer vision and ArUco marker detection",
        "Path planning algorithms (A*, WCBS)",
        "Real-time robotics simulation and visualization",
        "Sensor fusion and occupancy grid mapping",
        "Point cloud processing and ICP alignment",
        "Multi-agent system design and coordination"
      ]
    }
  },
  "FIR Filter Design & FPGA Implementation": {
    "4_letter": "FIR",
    "img": "img/projects/fir_filter/rtlschem.png",
    "description": "Comprehensive FPGA implementation of multiple FIR filter architectures for audio processing applications. Designed and analyzed four different filter implementations using AMD Vivado and System Verilog, including pipelined, parallel, and hybrid approaches optimized for performance, power, and area efficiency on Kintex-7 FPGA.",
    "time": "Mar '25",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/AmarMaksumic/FIR-Filter-Design",
          "title": "FIR Filter Design Repository",
          "preview": "img/projects/fir_filter/rtlschem.png"
        }
      ]
    },
    "tags": [
      "FPGA",
      "Digital Signal Processing",
      "VHDL/Verilog",
      "Audio Processing",
      "Hardware Design"
    ],
    "modal": {
      "detailed_description": "Advanced FPGA-based digital signal processing project implementing four distinct FIR filter architectures optimized for different performance criteria. This comprehensive study explores the trade-offs between throughput, latency, power consumption, and silicon area usage through systematic implementation and analysis of pipelined, parallel, and hybrid filter designs. Using AMD Vivado and System Verilog, the project demonstrates mastery of hardware design principles, DSP optimization techniques, and FPGA resource management for real-time audio processing applications.",
      "context": {
        "type": "academic",
        "title": "Advanced FPGA Design & DSP Optimization",
        "content": "This project represents a deep exploration of FPGA-based DSP implementation, addressing fundamental challenges in hardware filter design including performance optimization, resource utilization, and power efficiency. The work demonstrates advanced understanding of digital filter theory, FPGA architecture, and hardware design trade-offs essential for modern embedded DSP systems."
      },
      "technical_details": [
        {
          "icon": "🔧",
          "title": "Multi-Architecture FPGA Implementation",
          "content": "Designed and implemented four distinct FIR filter architectures: Pipelined FIR (8.66ns critical path), L2 Parallel (80.17ns), L3 Parallel (56.79ns), and Pipelined L3 Parallel (11.88ns) using System Verilog on Kintex-7 FPGA with comprehensive performance analysis."
        },
        {
          "icon": "📊",
          "title": "Advanced DSP Algorithm Optimization",
          "content": "Implemented Parks-McClellan algorithm for coefficient generation, 24-bit fixed-point quantization analysis, and sophisticated pipelining strategies including vertical pipeline optimization to achieve sub-10ns critical paths while maintaining signal integrity."
        },
        {
          "icon": "⚡",
          "title": "Hardware-Software Co-Design",
          "content": "Developed complete design flow including MATLAB coefficient generation, Python test signal creation, System Verilog RTL implementation, and comprehensive FPGA validation using Vivado synthesis, implementation, and timing analysis tools."
        },
        {
          "icon": "🎯",
          "title": "Performance Analysis & Validation",
          "content": "Conducted systematic analysis of critical path timing, power consumption (0.081W across all implementations), resource utilization (102-204 DSP blocks), and behavioral verification using comprehensive test benches with logarithmic frequency sweep validation."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "FPGA Design Excellence",
          "content": "Demonstrated mastery of advanced FPGA design techniques achieving 115.4 MHz maximum clock frequency with pipelined architecture while maintaining audio processing quality standards for CD-quality 44.1 kHz sampling."
        },
        {
          "icon": "📈",
          "title": "DSP Architecture Innovation",
          "content": "Established comprehensive comparison framework for FIR filter architectures, providing quantitative analysis of performance trade-offs between throughput (8.66ns vs 80.17ns critical path), latency (34-204 clock cycles), and resource utilization."
        },
        {
          "icon": "🔬",
          "title": "Research & Educational Impact",
          "content": "Created complete open-source FPGA filter design methodology with detailed documentation, RTL implementations, and analysis results serving as educational resource for advanced DSP and FPGA design."
        }
      ],
      "challenges": [
        {
          "title": "Multi-Architecture Performance Optimization",
          "description": "Balancing competing design objectives across four different architectures while optimizing for critical path timing, resource utilization, and power efficiency within FPGA constraints. Successfully achieved 10x improvement in critical path (80ns to 8ns) through strategic pipelining."
        },
        {
          "title": "Fixed-Point Precision Management",
          "description": "Managing numerical precision and quantization effects in 24-bit coefficient representation while maintaining -80dB stopband attenuation requirements. Implemented comprehensive analysis comparing 16-bit, 24-bit, and 32-bit representations."
        },
        {
          "title": "Complex FPGA Implementation & Validation",
          "description": "Developing robust System Verilog implementations with comprehensive test benches, behavioral simulation, and timing validation across multiple filter architectures while ensuring consistent audio processing performance."
        }
      ],
      "skills_gained": [
        "Advanced FPGA design using AMD Vivado and System Verilog",
        "Digital signal processing algorithm implementation and optimization",
        "FIR filter architecture design and performance analysis",
        "Hardware pipelining and parallelization techniques",
        "Fixed-point arithmetic and quantization analysis",
        "FPGA resource optimization and timing analysis",
        "Hardware-software co-design methodologies",
        "Advanced DSP validation and testing procedures"
      ]
    }
  },
  "Gain-Scheduled Traction Control System": {
    "4_letter": "TCS",
    "img": "img/projects/tcs/system.png",
    "description": "Advanced nonlinear control system implementing gain-scheduled PID controller for longitudinal traction control in rear-wheel drive motorcycle. Features Pacejka Magic Formula tire modeling, suspension dynamics integration, and real-time slip ratio regulation up to 1kHz for optimal traction under varying road conditions.",
    "time": "Mar '25 - Apr '25",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://www.linkedin.com/in/maksua/details/projects/1759898610202/single-media-viewer/?profileId=ACoAACwClcMB6GXAd_uAfyf9qoVC0ed8yXhg8mU",
          "title": "Project Report on LinkedIn",
          "preview": "img/projects/tcs/sim.png"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Automotive Systems",
      "Nonlinear Control",
      "MATLAB/Simulink"
    ],
    "modal": {
      "detailed_description": "Comprehensive development of an advanced traction control system (TCS) for rear-wheel drive motorcycles using sophisticated nonlinear control theory. This project implements a gain-scheduled PID controller that dynamically adapts to varying slip conditions through real-time torque modulation at rates up to 1kHz. The system incorporates the Pacejka Magic Formula for realistic tire force modeling and accounts for vehicle suspension dynamics to accurately represent load transfer effects. Through systematic linearization at key operating points and Hartman-Grobman stability analysis, the controller demonstrates superior performance over fixed-gain approaches across diverse road conditions and driving scenarios.",
      "context": {
        "type": "academic",
        "title": "ECSE 6420: Nonlinear Control Systems Final Project",
        "content": "This advanced control systems project addresses the fundamental challenge of maintaining optimal traction in nonlinear vehicle dynamics. Developed for RPI's graduate-level Nonlinear Control Systems course, the work demonstrates mastery of gain scheduling, stability analysis, and practical implementation of advanced control theory for safety-critical automotive applications."
      },
      "technical_details": [
        {
          "icon": "🎯",
          "title": "Advanced Gain Scheduling Implementation",
          "content": "Developed sophisticated gain scheduling strategy using linearized models at three key slip ratios (0%, 10%, 30%) with linear interpolation between operating points. Implemented lookup table approach with PID gains ranging from aggressive (Kp=1000, Ki=5000, Kd=15000) to conservative (Kp=50, Ki=150, Kd=300) based on desired slip conditions."
        },
        {
          "icon": "🔬",
          "title": "Pacejka Magic Formula Integration",
          "content": "Integrated empirical Pacejka Magic Formula for realistic tire force modeling with coefficients B, C, D, E representing different road surfaces. Coupled with suspension dynamics modeling including spring-mass-damper systems to accurately capture vertical load transfer effects and their impact on longitudinal traction forces."
        },
        {
          "icon": "📊",
          "title": "Comprehensive Stability Analysis",
          "content": "Performed rigorous stability analysis using Hartman-Grobman theorem with Jacobian linearization around equilibrium points. Validated system stability through eigenvalue analysis confirming negative real parts, enabling confident application of gain scheduling techniques to the nonlinear system."
        },
        {
          "icon": "⚡",
          "title": "Real-Time Control Architecture",
          "content": "Designed high-frequency control system capable of 1kHz torque modulation with slip ratio feedback from wheel speed differential measurements. Implemented longitudinal bicycle model with state-space representation incorporating angular velocity, linear velocity, and suspension dynamics for comprehensive system modeling."
        }
      ],
      "impact": [
        {
          "icon": "🚗",
          "title": "Automotive Safety Enhancement",
          "content": "Demonstrated significant improvement in vehicle stability and safety through adaptive traction control that maintains optimal slip ratios across diverse road conditions, from dry pavement to low-traction surfaces like snow and ice."
        },
        {
          "icon": "📈",
          "title": "Advanced Control Theory Application",
          "content": "Successfully applied sophisticated nonlinear control techniques to practical automotive problem, showcasing the effectiveness of gain scheduling over traditional fixed-gain approaches in highly nonlinear systems with varying operating conditions."
        },
        {
          "icon": "🔧",
          "title": "Simulation-to-Reality Foundation",
          "content": "Created comprehensive simulation framework with realistic vehicle modeling that provides strong foundation for real-world implementation in electric and hybrid vehicles where software-based traction control is increasingly important."
        }
      ],
      "challenges": [
        {
          "title": "Nonlinear System Modeling and Linearization",
          "description": "Successfully modeled complex tire-road interactions using Pacejka Magic Formula while managing the inherent nonlinearities in vehicle dynamics. Developed systematic approach to linearization around multiple operating points while maintaining system stability and performance across the full operating envelope."
        },
        {
          "title": "Gain Scheduling Optimization",
          "description": "Designed effective gain scheduling strategy that balances responsiveness with stability across diverse slip conditions. Addressed the challenge of smooth transitions between operating regions while avoiding gain scheduling artifacts and maintaining consistent performance from conservative (0% slip) to aggressive (30% slip) driving scenarios."
        },
        {
          "title": "Multi-Physics System Integration",
          "description": "Integrated multiple complex subsystems including tire dynamics, suspension mechanics, and vehicle longitudinal dynamics into a cohesive control framework. Managed the complexity of coupling between vertical load transfer, tire forces, and slip dynamics while maintaining real-time performance requirements."
        }
      ],
      "skills_gained": [
        "Advanced nonlinear control system design and analysis",
        "Gain scheduling implementation and optimization techniques",
        "Pacejka tire model integration and parameter tuning",
        "Vehicle dynamics modeling and simulation",
        "Stability analysis using Hartman-Grobman theorem",
        "MATLAB/Simulink advanced control system development",
        "Automotive traction control system architecture",
        "Multi-physics system modeling and integration"
      ]
    }
  },
  "STM32 CAN Network System": {
    "4_letter": "CAN",
    "img": "img/projects/stm_can/hardware.png",
    "description": "Comprehensive CAN (Controller Area Network) implementation using multiple STM32F769 Discovery Boards with MCP2551 transceivers. Developed multi-node communication system featuring real-time data exchange, differential signaling, message prioritization, and robust error detection for automotive and industrial applications.",
    "time": "Dec '24",
    "media": {
      "websites": [
        {
          "url": "https://www.linkedin.com/in/maksua/details/projects/1738174905829/single-media-viewer/?profileId=ACoAACwClcMB6GXAd_uAfyf9qoVC0ed8yXhg8mU",
          "title": "Project Report on LinkedIn",
          "preview": "img/projects/stm_can/arch.png"
        }
      ],
      "images": [
        "img/projects/stm_can/osc.png",
        "img/projects/stm_can/term.png"
      ],
      "videos": []
    },
    "tags": [
      "Embedded Systems",
      "STM32",
      "Communication Protocols",
      "Hardware Design",
      "Automotive Systems"
    ],
    "modal": {
      "detailed_description": "Advanced embedded systems project implementing a complete CAN (Controller Area Network) communication system across multiple STM32F769 Discovery Boards. This comprehensive implementation demonstrates mastery of automotive-grade communication protocols, featuring multi-node data exchange, differential signaling through MCP2551 transceivers, and real-time terminal interface. The system transmits diverse data types including button states, ADC readings, UART characters, and system diagnostics with robust error detection and checksum validation at 1 Mbps communication speed.",
      "context": {
        "type": "academic",
        "title": "ECSE 4790: Microprocessor Systems Final Project",
        "content": "This capstone project for RPI's Microprocessor Systems course demonstrates advanced understanding of embedded communication protocols and multi-device system integration. CAN networks are critical in automotive, industrial, and medical applications where reliable, prioritized communication between multiple devices is essential for system operation and safety."
      },
      "technical_details": [
        {
          "icon": "🚗",
          "title": "Automotive-Grade CAN Protocol Implementation",
          "content": "Implemented full CAN 2.0A protocol with 1 Mbps baud rate using STM32 hardware CAN peripheral. Configured precise timing parameters: 18 MHz CAN clock with prescaler=3, TimeSeg1=13 TQ, TimeSeg2=4 TQ for reliable multi-node communication with MCP2551 transceivers providing differential signaling."
        },
        {
          "icon": "📊",
          "title": "Multi-Sensor Data Integration",
          "content": "Developed comprehensive 8-byte payload structure transmitting button states (GPIO), 12-bit ADC values, UART terminal characters, frequency data, timeout management, transmission counters, and checksum validation with real-time error detection and correction capabilities."
        },
        {
          "icon": "🔧",
          "title": "Hardware-Software Co-Design",
          "content": "Designed complete system including MCP2551 transceiver interfacing, twisted-pair CAN bus topology, STM32 HAL driver integration, interrupt-driven UART communication, and comprehensive terminal interface for real-time system monitoring and debugging."
        },
        {
          "icon": "⚡",
          "title": "Real-Time System Performance",
          "content": "Achieved 20 Hz data transmission rate with 4 Hz terminal refresh, implementing interrupt-driven architecture with CAN RX FIFO management, circular buffer UART handling, and optimized system timing to prevent bus overload while maintaining responsive communication."
        }
      ],
      "impact": [
        {
          "icon": "🏭",
          "title": "Industrial Communication Standards",
          "content": "Demonstrated implementation of automotive and industrial standard CAN protocol, providing foundation for real-world embedded systems in automotive ECUs, industrial automation, and medical device networks requiring reliable multi-node communication."
        },
        {
          "icon": "🔬",
          "title": "Advanced Embedded Systems Mastery",
          "content": "Showcased comprehensive understanding of embedded system integration including communication protocols, interrupt handling, real-time performance optimization, and hardware-software interface design essential for professional embedded development."
        },
        {
          "icon": "📚",
          "title": "Educational Excellence & Documentation",
          "content": "Created detailed technical documentation including circuit diagrams, oscilloscope analysis, and system architecture that serves as educational resource for understanding CAN protocol implementation and multi-device embedded systems."
        }
      ],
      "challenges": [
        {
          "title": "Multi-Device Communication Coordination",
          "description": "Successfully coordinated communication between four STM32 Discovery Boards while managing message arbitration, collision avoidance, and maintaining system stability. Implemented proper CAN timing parameters and message prioritization to ensure reliable data exchange across all network nodes."
        },
        {
          "title": "Hardware Interface and Signal Integrity",
          "description": "Achieved reliable differential signaling through proper MCP2551 transceiver configuration and twisted-pair CAN bus implementation. Addressed noise reduction, reference voltage configuration (-2.5V), and proper grounding to maintain signal integrity in multi-device network."
        },
        {
          "title": "Real-Time Performance Optimization",
          "description": "Resolved system latency issues when running multiple concurrent processes (UART interrupts, ADC polling, timer interrupts) by optimizing interrupt priorities, implementing efficient circular buffers, and balancing terminal refresh rates to prevent bus overload while maintaining responsiveness."
        }
      ],
      "skills_gained": [
        "CAN protocol implementation and automotive communication standards",
        "STM32 HAL driver programming and peripheral configuration",
        "Multi-device embedded system architecture and coordination",
        "Hardware transceiver interfacing and differential signaling",
        "Real-time interrupt handling and system optimization",
        "Communication protocol debugging and oscilloscope analysis",
        "Embedded system documentation and technical reporting",
        "Industrial-grade embedded system design principles"
      ]
    }
  },
  "Hand Sign Detection ML System": {
    "4_letter": "HSD",
    "img": "img/projects/hand_sign/depth_image.png",
    "description": "Advanced machine learning system for hand gesture recognition using depth-based computer vision. Developed CNN and MLP models trained on custom 3D depth image dataset to enable interactive communication with Stretch robot in RPI's Mercer XLab through real-time hand sign classification.",
    "time": "Dec '24",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://www.linkedin.com/in/maksua/details/projects/1738175212545/single-media-viewer/?profileId=ACoAACwClcMB6GXAd_uAfyf9qoVC0ed8yXhg8mU",
          "title": "Project Report on LinkedIn",
          "preview": "img/projects/hand_sign/cnn_architecture.png"
        }
      ]
    },
    "tags": [
      "Machine Learning",
      "Computer Vision",
      "Deep Learning",
      "Robotics",
      "PyTorch"
    ],
    "modal": {
      "detailed_description": "Comprehensive machine learning project developing an advanced hand gesture recognition system for human-robot interaction applications. Created custom dataset using Intel D435i 3D camera capturing depth-based images of six distinct hand signs, then implemented and compared CNN and MLP architectures using PyTorch. The system achieves 91.39% testing accuracy with CNN model, enabling real-time gesture classification for interactive robotics applications. This innovative approach leverages depth sensing for robust feature extraction, demonstrating superior performance over traditional RGB-based methods for spatial gesture recognition.",
      "context": {
        "type": "academic",
        "title": "Introduction to Machine Learning Final Project",
        "content": "This project addresses the challenge of enabling meaningful human-robot interaction through gesture recognition for RPI's Stretch robot in the Mercer XLab. Rather than relying on generic chatbot interfaces, the system creates intuitive, gesture-based communication that showcases innovative student capabilities while providing practical functionality for interactive robotics applications."
      },
      "technical_details": [
        {
          "icon": "🤖",
          "title": "Advanced CNN Architecture Implementation",
          "content": "Developed sophisticated convolutional neural network with optimized kernel sizes (2x2), 2D batch normalization, and strategic dropout layers. Implemented three convolutional layers with ReLU activation, max pooling, and dual fully connected layers achieving 91.39% testing accuracy with effective overfitting prevention through regularization."
        },
        {
          "icon": "📊",
          "title": "Custom Depth-Based Dataset Creation",
          "content": "Curated comprehensive dataset of 3,300 depth images across six hand gesture classes using Intel D435i 3D camera. Implemented pinhole camera model projection, statistical depth filtering (mean ± 1.5σ), and 8-bit normalization pipeline converting 3D point clouds to optimized 224x224 depth images for ML processing."
        },
        {
          "icon": "🔬",
          "title": "Comparative ML Model Analysis",
          "content": "Systematically compared CNN vs MLP architectures using identical training protocols, Cross-Entropy loss, and Adam optimizer. Implemented comprehensive evaluation framework with confusion matrices, ROC curves, and hyperparameter tuning achieving CNN: 91.39% vs MLP: 86.28% testing accuracy."
        },
        {
          "icon": "⚡",
          "title": "Real-Time Processing Pipeline",
          "content": "Developed efficient preprocessing pipeline with Savitzky-Golay filtering for loss smoothing, custom PyTorch dataset classes, and GPU-accelerated inference enabling real-time gesture classification suitable for interactive robotics deployment on Stretch robot platform."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "Human-Robot Interaction Innovation",
          "content": "Created practical solution for intuitive robot communication enabling meaningful gesture-based commands ('follow me', 'stop', 'explain') that demonstrates student innovation beyond generic AI interfaces, directly applicable to Stretch robot in Mercer XLab interactive tours."
        },
        {
          "icon": "📈",
          "title": "Depth-Based Vision Advancement",
          "content": "Pioneered depth-sensing approach for hand gesture recognition showing advantages over traditional RGB methods for spatial feature extraction, particularly effective for finger position analysis and hand orientation detection in challenging lighting conditions."
        },
        {
          "icon": "🔧",
          "title": "Open-Source ML Framework",
          "content": "Developed complete machine learning pipeline with custom dataset creation tools, model architectures, and evaluation frameworks available for broader robotics community, enabling replication and extension for similar interactive robotics applications."
        }
      ],
      "challenges": [
        {
          "title": "Dataset Quality and Overfitting Management",
          "description": "Overcame significant challenges with depth image quality including missing finger data and inconsistent depth patterns. Addressed severe CNN overfitting (100% training accuracy with poor testing) through strategic regularization, dropout implementation, dataset expansion to 3,300 samples, and rigorous data pruning removing indistinguishable samples."
        },
        {
          "title": "Depth Image Processing and Optimization",
          "description": "Developed sophisticated preprocessing pipeline to handle noisy 3D point cloud data, implementing statistical filtering algorithms, 16-bit to 8-bit conversion, and spatial normalization while preserving critical hand features. Optimized image resolution from 640x480 to 224x224 balancing detail retention with computational efficiency."
        },
        {
          "title": "Multi-Class Classification Accuracy",
          "description": "Addressed significant misclassification challenges between similar gestures (hangloose, spiderman, peace) through careful dataset curation, hyperparameter optimization (kernel size reduction from 3x3 to 2x2), and advanced evaluation using confusion matrices and ROC analysis to achieve 91.39% final accuracy."
        }
      ],
      "skills_gained": [
        "Advanced PyTorch deep learning implementation and optimization",
        "Custom computer vision dataset creation and preprocessing",
        "3D point cloud processing and depth image conversion",
        "CNN and MLP architecture design and comparison",
        "Machine learning model evaluation and validation techniques",
        "Overfitting detection and regularization strategies",
        "Real-time computer vision pipeline development",
        "Human-robot interaction system design"
      ]
    }
  },
  "RPI Robotic Art Installation": {
    "4_letter": "Line",
    "img": "img/projects/RAI.jpg",
    "description": "Art installation for the RPI campus. Comprised of several dozen origami units that opened and closed in response to user stimulus from a computer vision system. Served as the Team Lead for the project, helped with programming and electrical work.",
    "time": "Dec '22 - Dec '23",
    "resources": {},
    "tags": [
      "Computer Vision",
      "Robotics",
      "Art Installation"
    ],
    "modal": {
      "detailed_description": "An innovative interactive art installation that combined robotics, computer vision, and artistic expression for the RPI campus. The installation featured several dozen responsive origami units that created dynamic visual patterns through coordinated movement based on real-time computer vision analysis of user interactions. This project bridged the gap between technology and art, creating an engaging public space that responded to human presence and movement.",
      "context": {
        "type": "research",
        "title": "Interactive Art & Technology Integration",
        "content": "This installation represented the intersection of engineering and artistic expression, demonstrating how advanced robotics and computer vision could create meaningful human-technology interactions in public spaces. The project showcased RPI's commitment to innovation in both technical and creative domains."
      },
      "technical_details": [
        {
          "icon": "👁️",
          "title": "Computer Vision System",
          "content": "Implemented real-time person detection and tracking using advanced computer vision algorithms to analyze user movement patterns, proximity, and gestures for responsive art installation control."
        },
        {
          "icon": "🤖",
          "title": "Coordinated Robotics",
          "content": "Synchronized control of multiple origami units using distributed microcontroller systems with precise servo control and wireless communication for coordinated artistic movements."
        },
        {
          "icon": "🎨",
          "title": "Interactive Design",
          "content": "Developed algorithmic pattern generation that translated human movement into beautiful, flowing origami animations, creating unique artistic experiences for each interaction."
        }
      ],
      "impact": [
        {
          "icon": "🎯",
          "title": "Campus Enhancement",
          "content": "Created an engaging interactive experience that enhanced the RPI campus environment and demonstrated the university's leadership in innovative technology applications."
        },
        {
          "icon": "👥",
          "title": "Interdisciplinary Collaboration",
          "content": "Led cross-functional teams combining engineering, computer science, and artistic design principles to create a unified technical-artistic vision."
        },
        {
          "icon": "🔬",
          "title": "Research Innovation",
          "content": "Advanced the field of interactive installations by developing novel approaches to human-robot interaction in artistic contexts."
        }
      ],
      "challenges": [
        {
          "title": "Real-Time Responsiveness",
          "description": "Ensured seamless, low-latency response to user interactions while coordinating dozens of mechanical units in real-time."
        },
        {
          "title": "Durability",
          "description": "Designed robust systems that could withstand wear-and-tear while maintaining precise mechanical operation and reliable electronics."
        },
        {
          "title": "Artistic-Technical Balance",
          "description": "Balanced technical capabilities with artistic vision to create meaningful aesthetic experiences while maintaining system reliability."
        }
      ],
      "skills_gained": [
        "Computer vision and image processing",
        "Multi-robot coordination and control",
        "Wireless communication protocols",
        "Interdisciplinary project management",
        "Public installation design and deployment",
        "Real-time system optimization",
        "Artistic-technical integration"
      ]
    }
  },
  "RPI Ungergrad Research: Inverse Kinematics": {
    "4_letter": "IK URP",
    "img": "img/projects/ik_urp.png",
    "description": "Worked on C++ implementation of subproblem solutions using a linear algebra approach from \"Canonical Subproblems for Robot Inverse Kinematics\"",
    "time": "Sep '22 - May '23",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/rpiRobotics/linear-subproblem-solutions",
          "title": "Inverse Kinematics Research Repository",
          "preview": "img/projects/ik_urp.png"
        }
      ]
    },
    "tags": [
      "Robotics",
      "C++",
      "Research"
    ],
    "modal": {
      "detailed_description": "Contributed to cutting-edge robotics research through the development of advanced inverse kinematics algorithms using linear algebra approaches. This undergraduate research program focused on implementing canonical subproblem solutions that form the mathematical foundation for robot motion planning and control. Working with graduate students and faculty to advance the state of the art in robotic kinematics, contributing to open-source research that benefits the broader robotics community.",
      "context": {
        "type": "research",
        "title": "Advanced Robotics Research at RPI",
        "content": "This research contributes to RPI's renowned robotics program, working alongside faculty and graduate students to solve fundamental problems in robot motion planning. The work focuses on canonical subproblems that form the building blocks for more complex robotic systems and has applications in industrial automation, autonomous vehicles, and advanced manufacturing."
      },
      "technical_details": [
        {
          "icon": "🔬",
          "title": "Mathematical Algorithm Implementation",
          "content": "Developed robust C++ implementations of canonical subproblem solutions using advanced linear algebra techniques, focusing on numerical stability and computational efficiency for real-time applications."
        },
        {
          "icon": "⚙️",
          "title": "Inverse Kinematics Solutions",
          "content": "Implemented multiple solution strategies for inverse kinematics problems, handling both analytical and numerical approaches with emphasis on singularity avoidance and solution optimization."
        },
        {
          "icon": "📐",
          "title": "Linear Algebra Optimization",
          "content": "Utilized advanced matrix operations and linear algebra libraries to optimize computational performance while maintaining numerical precision in kinematic calculations."
        }
      ],
      "impact": [
        {
          "icon": "📚",
          "title": "Open Source Contribution",
          "content": "Contributed to open-source research repository that serves as a foundation for other researchers and developers working on robotic kinematics problems."
        },
        {
          "icon": "🤝",
          "title": "Academic Collaboration",
          "content": "Worked directly with faculty and graduate students, contributing to ongoing research projects and gaining exposure to academic research methodologies."
        },
        {
          "icon": "🚀",
          "title": "Foundation for Advanced Applications",
          "content": "Research contributes to enabling more sophisticated robot control systems for industrial and autonomous applications."
        }
      ],
      "challenges": [
        {
          "title": "Mathematical Complexity",
          "description": "Understanding and implementing complex mathematical concepts in inverse kinematics while ensuring numerical stability and computational efficiency."
        },
        {
          "title": "Algorithm Optimization",
          "description": "Balancing mathematical rigor with practical computational constraints for real-time robotic applications."
        },
        {
          "title": "Research Methodology",
          "description": "Learning academic research processes, documentation standards, and collaborative development practices in a research environment."
        }
      ],
      "skills_gained": [
        "Advanced C++ programming and optimization",
        "Linear algebra and mathematical modeling",
        "Inverse kinematics algorithm development",
        "Academic research methodologies",
        "Open-source software development",
        "Mathematical software library utilization",
        "Collaborative research practices"
      ]
    }
  },
  "Power Take-Off Gearbox": {
    "4_letter": "PTO",
    "img": "img/projects/ptov2.jpg",
    "description": "Drop-in replacement for VexPro Three CIM Ball Shifter, while providing independent outputs to two mechanisms. All electronics and pneumatics are located to one side (to prevent interference with wheels and chassis), and the second output is fitted with a power shuttle to reverse output direction (in the case that both outputs run at the same time).",
    "time": "Mar '20 - Jun '21",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://cad.onshape.com/documents/9fe8a78d285bab0307f97abb/w/89d3e6984a2b0de5430c622c/e/8737fa940d2e3063bf9912e8",
          "title": "PTO CAD Model",
          "preview": "img/projects/ptov2.jpg"
        }
      ]
    },
    "tags": [
      "Mechanical Engineering",
      "Robotics",
      "Design Engineering"
    ],
    "modal": {
      "detailed_description": "Designed and developed an innovative mechanical solution for FRC robotics applications, creating a sophisticated power transmission system that significantly improves upon existing VexPro solutions. This custom gearbox addresses critical design challenges in robotics by providing dual independent outputs while maintaining compact packaging and optimal component placement. The design demonstrates advanced mechanical engineering principles including gear train optimization, pneumatic integration, and space-efficient layout for competitive robotics applications.",
      "context": {
        "type": "development",
        "title": "Advanced Robotics Drivetrain Innovation",
        "content": "This project addresses fundamental limitations in existing FRC drivetrain components by providing enhanced functionality through innovative mechanical design. The Power Take-Off Gearbox represents a significant advancement in robotics power transmission, enabling more sophisticated robot mechanisms while maintaining the reliability and performance required for competitive robotics."
      },
      "technical_details": [
        {
          "icon": "⚙️",
          "title": "Dual Independent Output System",
          "content": "Engineered sophisticated gear train providing two independent mechanical outputs from a single input source, enabling simultaneous control of multiple robot mechanisms with precision and efficiency."
        },
        {
          "icon": "🔧",
          "title": "Integrated Pneumatic Power Shuttle",
          "content": "Designed and implemented pneumatic power shuttle system for dynamic output direction reversal, allowing flexible mechanism control during competition scenarios."
        },
        {
          "icon": "📐",
          "title": "Space-Optimized Component Layout",
          "content": "Achieved compact, single-sided electronics and pneumatics placement to prevent chassis interference while maintaining accessibility for maintenance and adjustment."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "Performance Enhancement",
          "content": "Provided significant improvement over standard VexPro solutions, enabling more sophisticated robot designs and enhanced competitive performance capabilities."
        },
        {
          "icon": "🔄",
          "title": "Design Innovation",
          "content": "Created novel mechanical solution that addresses multiple engineering challenges simultaneously, demonstrating advanced problem-solving in mechanical design."
        },
        {
          "icon": "🏗️",
          "title": "Manufacturing Excellence",
          "content": "Developed manufacturable design that balances performance requirements with practical fabrication constraints and cost considerations."
        }
      ],
      "challenges": [
        {
          "title": "Multi-Output Coordination",
          "description": "Engineering precise coordination between dual outputs while maintaining independent control authority and preventing mechanical interference."
        },
        {
          "title": "Space Constraint Optimization",
          "description": "Achieving compact design that accommodates all necessary components while preventing interference with other robot systems and maintaining serviceability."
        },
        {
          "title": "Performance vs. Complexity Balance",
          "description": "Optimizing mechanical complexity to provide advanced functionality while maintaining reliability and ease of manufacturing within competition constraints."
        }
      ],
      "skills_gained": [
        "Advanced mechanical design and analysis",
        "Gear train design and optimization",
        "Pneumatic system integration",
        "Space-constrained engineering solutions",
        "Manufacturing process consideration",
        "Mechanical system testing and validation",
        "Component integration and packaging"
      ]
    }
  },
  "Aquila Heavy": {
    "4_letter": "QLA HVY",
    "img": "img/projects/aquila_heavy.jpg",
    "description": "Thrust Vector Controlled model rocket using a dual Arduino telemetry and control system. Can recorded flight data like altitude, pitch, yaw, and roll along with camera feed.",
    "time": "Dec '20 - Jun '21",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://cad.onshape.com/documents/4e32d9f36a97adf58a6869c2/w/24def73a5e4a5848b79d8d09/e/69e1de1bbc6c503f41a5028c",
          "title": "Aquila Heavy CAD Model",
          "preview": "img/projects/aquila_heavy.jpg"
        },
        {
          "url": "https://github.com/AmarMaksumic/AquilaHeavy",
          "title": "Aquila Heavy Software Repository",
          "preview": "img/projects/aquila_heavy.jpg"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Rocketry",
      "Mechanical Engineering",
      "Aerospace"
    ],
    "modal": {
      "detailed_description": "Developed a sophisticated thrust vector controlled model rocket system featuring advanced flight control, telemetry, and data acquisition capabilities. Aquila Heavy represents a comprehensive aerospace engineering project combining mechanical design, control systems, embedded programming, and real-time data processing. The dual Arduino architecture enables complex flight control algorithms while maintaining robust telemetry and video recording capabilities, demonstrating practical applications of aerospace control theory in a model rocketry platform.",
      "context": {
        "type": "aerospace",
        "title": "Advanced Model Rocketry & Control Systems",
        "content": "This project explores cutting-edge model rocketry technology by implementing thrust vector control (TVC) systems typically found in professional launch vehicles. Aquila Heavy serves as a practical testbed for aerospace engineering concepts including flight dynamics, control theory, and real-time embedded systems in a challenging flight environment."
      },
      "technical_details": [
        {
          "icon": "🚀",
          "title": "Thrust Vector Control System",
          "content": "Implemented sophisticated TVC using servo-actuated engine gimbal system with real-time feedback control, enabling active flight path correction and stability enhancement during powered flight phases."
        },
        {
          "icon": "📡",
          "title": "Dual Arduino Telemetry Architecture",
          "content": "Designed redundant control system using dual Arduino processors for flight control and data acquisition, ensuring system reliability and enabling complex multi-threaded operations during flight."
        },
        {
          "icon": "📊",
          "title": "Comprehensive Flight Data Recording",
          "content": "Developed multi-sensor data acquisition system capturing altitude, 6-DOF orientation data, acceleration, and synchronized video feed for complete flight analysis and performance evaluation."
        }
      ],
      "impact": [
        {
          "icon": "🎯",
          "title": "Advanced Control System Validation",
          "content": "Successfully demonstrated practical implementation of aerospace control theory in model rocket platform, validating TVC algorithms and flight control methodologies."
        },
        {
          "icon": "📈",
          "title": "Performance Data Analysis",
          "content": "Generated comprehensive flight performance datasets enabling detailed analysis of rocket dynamics, control system effectiveness, and aerodynamic behavior."
        },
        {
          "icon": "🔬",
          "title": "Educational Research Platform",
          "content": "Created reusable platform for ongoing aerospace engineering research and experimentation, enabling future projects and design iterations."
        }
      ],
      "challenges": [
        {
          "title": "Real-Time Flight Control",
          "description": "Implementing stable, responsive thrust vector control algorithms operating within the demanding constraints of model rocket flight dynamics and limited computational resources."
        },
        {
          "title": "System Integration Complexity",
          "description": "Coordinating multiple subsystems including mechanical actuators, sensors, data logging, and video recording within strict weight and space constraints of model rocket platform."
        },
        {
          "title": "Reliability in Harsh Conditions",
          "description": "Ensuring electronic systems remain operational under high acceleration, vibration, and thermal stress conditions experienced during rocket flight."
        }
      ],
      "skills_gained": [
        "Aerospace control system design and implementation",
        "Thrust vector control algorithm development",
        "Multi-processor embedded system architecture",
        "Real-time data acquisition and processing",
        "Flight dynamics analysis and modeling",
        "Mechanical actuator integration and control",
        "High-performance system integration under constraints"
      ]
    }
  },
  "ML-CV": {
    "4_letter": "ML CV",
    "img": "img/projects/mlcv.jpg",
    "description": "Hybrid Computer Vision System coded in Python for the 2020/21 FRC game. Utilizes OpenCV algorithms alongside a Transfer Trained MobileNet SSD model for video processing and error correction. Uses Tornado and Websockets for relaying data to the robot and driver.",
    "time": "Mar '20 - Feb '21",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/AmarMaksumic/ML-CV",
          "title": "ML-CV Software Repository",
          "preview": "img/projects/mlcv.jpg"
        }
      ]
    },
    "tags": [
      "Computer Vision",
      "Machine Learning",
      "IoT & Networking",
      "Deep Learning"
    ],
    "modal": {
      "detailed_description": "Developed an innovative hybrid computer vision system that combines traditional OpenCV algorithms with modern deep learning techniques for enhanced FRC robot vision capabilities. This sophisticated system leverages transfer learning on MobileNet SSD architecture to achieve superior object detection accuracy while maintaining real-time performance requirements. The integration of classical computer vision with machine learning represents a cutting-edge approach to competitive robotics vision systems, featuring robust network communication and error correction mechanisms.",
      "context": {
        "type": "competition",
        "title": "Next-Generation FRC Vision Technology",
        "content": "This project represents the evolution of FRC vision systems from traditional OpenCV-based approaches to hybrid AI-enhanced solutions. Developed for the 2020/21 FRC season, ML-CV addresses the increasing complexity of game elements and environmental challenges through the strategic combination of classical computer vision and modern deep learning techniques."
      },
      "technical_details": [
        {
          "icon": "🤖",
          "title": "Hybrid AI-Classical Vision Pipeline",
          "content": "Integrated transfer-trained MobileNet SSD deep learning model with traditional OpenCV algorithms, creating a robust system that leverages the strengths of both approaches for optimal detection accuracy and performance."
        },
        {
          "icon": "🔄",
          "title": "Intelligent Error Correction System",
          "content": "Implemented sophisticated error correction algorithms that cross-validate results between classical and ML approaches, significantly improving system reliability and reducing false positives in competition environments."
        },
        {
          "icon": "🌐",
          "title": "Real-time Network Communication",
          "content": "Developed high-performance networking solution using Tornado web framework and WebSocket protocols for ultra-low latency data transmission to robot control systems and driver interfaces."
        }
      ],
      "impact": [
        {
          "icon": "🏆",
          "title": "Competitive Advantage Achievement",
          "content": "Provided significant competitive advantage through superior detection accuracy and reliability compared to traditional vision systems, enabling more sophisticated autonomous operation."
        },
        {
          "icon": "🔬",
          "title": "Innovation in FRC Vision",
          "content": "Pioneered the integration of deep learning techniques in FRC competition environment, establishing new standards for vision system capabilities and performance."
        },
        {
          "icon": "📚",
          "title": "Knowledge Base Contribution",
          "content": "Created comprehensive documentation and open-source implementation that enables other FRC teams to adopt similar hybrid vision approaches."
        }
      ],
      "challenges": [
        {
          "title": "Performance Optimization Balance",
          "description": "Achieving optimal balance between deep learning model accuracy and real-time performance requirements within computational constraints of FRC robot platforms."
        },
        {
          "title": "Model Training and Optimization",
          "description": "Successfully implementing transfer learning techniques to adapt MobileNet SSD for specific FRC game elements while maintaining generalization capabilities."
        },
        {
          "title": "System Integration Complexity",
          "description": "Seamlessly integrating classical computer vision, deep learning models, and network communication systems into a cohesive, reliable competition-ready platform."
        }
      ],
      "skills_gained": [
        "Deep learning model integration and optimization",
        "Transfer learning implementation techniques",
        "Hybrid AI-classical algorithm development",
        "Real-time system performance optimization",
        "Advanced network communication protocols",
        "Computer vision algorithm hybridization",
        "Competition-focused machine learning deployment"
      ]
    }
  },
  "BlueComms": {
    "4_letter": "BC",
    "img": "img/projects/bluecomm.jpg",
    "description": "Cross-Computer communication for functions like copy, paste, cut, etc. using Bluetooth. Currently working on designing an installer for the code so that it can run as a background program instead of a script that must be manually executed on machine startup.",
    "time": "Jan '21",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/AmarMaksumic/BlueComms",
          "title": "BlueComms Software Repository",
          "preview": "img/projects/bluecomm.jpg"
        }
      ]
    },
    "tags": [
      "IoT & Networking",
      "System Integration",
      "Software Development"
    ],
    "modal": {
      "detailed_description": "Developed an innovative cross-platform communication solution that enables seamless clipboard operations between multiple computers using Bluetooth connectivity. BlueComms addresses the growing need for efficient multi-device workflows by providing transparent, wireless clipboard sharing that feels native to each operating system. The project demonstrates advanced understanding of system-level programming, wireless protocols, and user experience design through the creation of a sophisticated background service architecture.",
      "context": {
        "type": "productivity",
        "title": "Multi-Device Workflow Enhancement",
        "content": "In today's multi-device computing environment, BlueComms addresses the fundamental challenge of seamless data transfer between computers. This project recognizes the inefficiencies in current workflow patterns and provides an elegant solution through wireless clipboard synchronization, significantly enhancing productivity for users working across multiple machines."
      },
      "technical_details": [
        {
          "icon": "📱",
          "title": "Bluetooth Protocol Implementation",
          "content": "Developed robust Bluetooth communication protocol for reliable, low-latency clipboard data transmission between paired devices, handling various data types and ensuring secure connections."
        },
        {
          "icon": "🔄",
          "title": "System-Level Integration",
          "content": "Implemented deep system integration for seamless clipboard monitoring and manipulation across multiple operating systems, ensuring native-feeling user experience without manual intervention."
        },
        {
          "icon": "⚙️",
          "title": "Background Service Architecture",
          "content": "Designed comprehensive background service system with automatic startup capabilities, system tray integration, and persistent connection management for transparent operation."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "Productivity Enhancement",
          "content": "Significantly improved workflow efficiency for multi-device users by eliminating friction in cross-device data transfer and enabling seamless computing experiences."
        },
        {
          "icon": "🔧",
          "title": "User Experience Innovation",
          "content": "Created intuitive, transparent solution that requires no user training or workflow changes, demonstrating excellent user-centered design principles."
        },
        {
          "icon": "🌐",
          "title": "Cross-Platform Compatibility",
          "content": "Developed solution that works across different operating systems, providing universal utility and broad applicability for diverse computing environments."
        }
      ],
      "challenges": [
        {
          "title": "Cross-Platform System Integration",
          "description": "Developing consistent functionality across different operating systems while handling platform-specific clipboard APIs and Bluetooth stack variations."
        },
        {
          "title": "Reliable Wireless Communication",
          "description": "Ensuring robust Bluetooth connectivity with automatic reconnection capabilities and graceful handling of connection interruptions and device pairing issues."
        },
        {
          "title": "Background Service Development",
          "description": "Creating seamless background operation with proper installer design, automatic startup functionality, and minimal system resource utilization."
        }
      ],
      "skills_gained": [
        "Bluetooth protocol programming and implementation",
        "Cross-platform system-level development",
        "Background service and daemon programming",
        "System clipboard API integration",
        "Wireless communication protocol design",
        "User experience and interface design",
        "Software packaging and installer development"
      ]
    }
  },
  "HawkEye": {
    "4_letter": "hwk eye",
    "img": "img/projects/hawk_eye.jpg",
    "description": "Computer Vision System coded in Python for the 2020 FRC game. Utilizes OpenCV, Tornado, and Websockets for video processing and relaying data to the robot and driver.",
    "time": "Jan '20 - Mar '20",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://github.com/steelhawks/2020Vision",
          "title": "HawkEye Software Repository",
          "preview": "img/projects/hawk_eye.jpg"
        }
      ]
    },
    "tags": [
      "Computer Vision",
      "IoT & Networking",
      "Robotics",
      "Competition"
    ],
    "modal": {
      "detailed_description": "Developed a comprehensive computer vision system for the 2020 FIRST Robotics Competition, providing advanced visual processing capabilities for autonomous robot operation and driver assistance. HawkEye represents a complete vision pipeline solution optimized for the dynamic, fast-paced environment of FRC competition. The system integrates sophisticated image processing algorithms with high-performance networking to deliver real-time visual data to robot control systems and human drivers, significantly enhancing competitive performance.",
      "context": {
        "type": "competition",
        "title": "FRC 2020 'Infinite Recharge' Vision Solution",
        "content": "Developed for the 2020 FRC season game 'Infinite Recharge', HawkEye provided critical vision capabilities for power cell detection, target identification, and autonomous navigation. This system enabled Team 2601 SteelHawks to compete at the highest levels through advanced computer vision technology."
      },
      "technical_details": [
        {
          "icon": "👁️",
          "title": "Advanced OpenCV Processing Pipeline",
          "content": "Implemented sophisticated computer vision algorithms using OpenCV for real-time object detection, tracking, and measurement, optimized for FRC game elements and competition lighting conditions."
        },
        {
          "icon": "⚡",
          "title": "High-Performance Network Communication",
          "content": "Developed ultra-low latency networking solution using Tornado web framework and WebSocket protocols to stream processed vision data to robot systems and driver stations in real-time."
        },
        {
          "icon": "🎯",
          "title": "Competition-Optimized Processing",
          "content": "Fine-tuned algorithms for the specific requirements of FRC competition environment, including variable lighting, fast-moving targets, and strict real-time performance constraints."
        }
      ],
      "impact": [
        {
          "icon": "🏆",
          "title": "Competitive Performance Enhancement",
          "content": "Enabled superior autonomous period performance and enhanced driver capabilities, contributing directly to improved match scores and competition rankings for Team 2601."
        },
        {
          "icon": "👥",
          "title": "Team Technical Foundation",
          "content": "Established comprehensive vision system architecture that became the foundation for future FRC seasons and advanced vision projects like ML-CV."
        },
        {
          "icon": "📚",
          "title": "Open Source Contribution",
          "content": "Provided complete implementation as open-source project, enabling other FRC teams to benefit from advanced vision capabilities and contributing to the broader FRC community."
        }
      ],
      "challenges": [
        {
          "title": "Real-Time Performance Under Pressure",
          "description": "Achieving consistent, reliable vision processing performance in the high-stress, variable conditions of FRC competition environments while maintaining low latency requirements."
        },
        {
          "title": "Dynamic Environmental Adaptation",
          "description": "Developing robust algorithms that maintain accuracy across varying lighting conditions, camera angles, and field configurations encountered in different competition venues."
        },
        {
          "title": "Network Reliability and Integration",
          "description": "Ensuring stable, high-performance network communication between vision processing systems and robot control platforms under competition network constraints."
        }
      ],
      "skills_gained": [
        "Competition-focused computer vision development",
        "Real-time image processing optimization",
        "High-performance networking and WebSocket protocols",
        "Team collaboration and technical leadership",
        "Competition environment system deployment",
        "OpenCV advanced algorithm implementation",
        "Python performance optimization techniques"
      ]
    }
  },
  "FRC 2601 - 2K20 Robot, Hylo Wren": {
    "4_letter": "SH '20",
    "img": "img/projects/sh2k20.jpg",
    "description": "Worked on various software systems with other engineers on the team for FRC Team 2601's 2020 robot.",
    "time": "Jan '20 - Mar '20",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://steelhawks.net/robots",
          "title": "SteelHawks Robots Page",
          "preview": "img/projects/sh2k20.jpg"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Robotics",
      "Software Engineering",
      "Competition"
    ],
    "modal": {
      "detailed_description": "Contributed to the development of Hylo Wren, Team 2601 SteelHawks' 2020 competition robot designed for the 'Infinite Recharge' FRC game. This project involved collaborative software engineering efforts to create sophisticated control systems that enabled the robot to excel in power cell manipulation, climbing mechanisms, and autonomous operation. The work demonstrates advanced understanding of competitive robotics software architecture and the ability to contribute effectively to complex, time-critical engineering projects under competition pressure.",
      "context": {
        "type": "competition",
        "title": "FRC 2020 'Infinite Recharge' Competition Robot",
        "content": "The 2020 FRC season featured the 'Infinite Recharge' game where robots needed to score power cells in various targets and navigate complex field obstacles. Hylo Wren was designed to excel in this challenging environment through sophisticated software systems that coordinated multiple mechanisms and enabled both autonomous and teleoperated performance."
      },
      "technical_details": [
        {
          "icon": "🤖",
          "title": "Multi-System Robot Control Architecture",
          "content": "Developed integrated software systems coordinating drivetrain, manipulation mechanisms, climbing systems, and autonomous routines within a unified control architecture optimized for competition performance."
        },
        {
          "icon": "🎯",
          "title": "Game-Specific Automation Systems",
          "content": "Implemented specialized control algorithms for power cell handling, target acquisition, and scoring mechanisms tailored specifically to the requirements of the 'Infinite Recharge' game."
        },
        {
          "icon": "🔄",
          "title": "Collaborative Software Development",
          "content": "Participated in team-based software development using version control, code review processes, and collaborative debugging to ensure reliable, maintainable competition code."
        }
      ],
      "impact": [
        {
          "icon": "🏆",
          "title": "Competition Performance Success",
          "content": "Contributed to successful robot performance in the 2020 FRC season, with software systems enabling competitive autonomous scoring and reliable teleoperated control."
        },
        {
          "icon": "👥",
          "title": "Team Collaboration Excellence",
          "content": "Demonstrated effective collaboration in high-pressure engineering environment, contributing to team success through reliable software engineering and problem-solving."
        },
        {
          "icon": "🔧",
          "title": "Technical Foundation Building",
          "content": "Established software architecture and development practices that supported future team projects and provided foundation for advanced vision systems like HawkEye."
        }
      ],
      "challenges": [
        {
          "title": "Competition Timeline Pressure",
          "description": "Developing reliable, high-performance software systems within the compressed timeline of FRC build season while meeting strict competition deadlines."
        },
        {
          "title": "Multi-System Integration",
          "description": "Coordinating software for multiple robot subsystems while ensuring reliable operation and maintainable code architecture under competition conditions."
        },
        {
          "title": "Team Coordination and Communication",
          "description": "Effectively collaborating with multiple engineers on shared codebase while maintaining code quality and system reliability standards."
        }
      ],
      "skills_gained": [
        "Collaborative software development in engineering teams",
        "Competition robotics control system architecture",
        "Real-time system coordination and timing",
        "Version control and team development workflows",
        "Problem-solving under competition pressure",
        "Multi-subsystem integration and testing",
        "Game-specific algorithm development and optimization"
      ]
    }
  },
  "Swerve Drive": {
    "4_letter": "SWE RVE",
    "img": "img/projects/swerve.jpg",
    "description": "Worked on the development of a swerve drivetrain prototype for my FRC team. I designed CAD models for the modules and chassis of a swerve drive. In addition, I developed the control systems for both robot orientated and field orientated control of the swerve.",
    "time": "Sep '19 - Dec '19",
    "media": {
      "images": [
        "img/projects/swerve.jpg"
      ],
      "videos": [],
      "websites": []
    },
    "tags": [
      "Mechanical Engineering",
      "Control Systems",
      "Robotics",
      "CAD Design"
    ],
    "modal": {
      "detailed_description": "Designed and developed a sophisticated swerve drive system representing one of the most advanced drivetrain technologies in competitive robotics. This comprehensive project encompassed both mechanical design and control systems development, creating a prototype that demonstrates mastery of complex mechanical engineering principles. The swerve drive enables omnidirectional movement with independent wheel speed and direction control, providing superior maneuverability compared to traditional drivetrain systems and representing cutting-edge technology in FRC robotics.",
      "context": {
        "type": "development",
        "title": "Advanced Robotics Drivetrain Technology",
        "content": "Swerve drive systems represent the pinnacle of FRC drivetrain technology, requiring sophisticated mechanical design and control algorithms. This project addresses the challenge of creating highly maneuverable robots capable of omnidirectional movement, rotation while translating, and precise field positioning - capabilities that provide significant competitive advantages in FRC competition scenarios."
      },
      "technical_details": [
        {
          "icon": "📐",
          "title": "Advanced CAD Design and Modeling",
          "content": "Developed comprehensive CAD models for swerve modules and chassis integration, including precise mechanical tolerances, assembly constraints, and manufacturing considerations for high-performance drivetrain components."
        },
        {
          "icon": "⚙️",
          "title": "Dual-Axis Control Systems",
          "content": "Implemented sophisticated control algorithms managing both drive motor speed and steering angle for each module, enabling independent control of translation and rotation for omnidirectional movement capabilities."
        },
        {
          "icon": "🧠",
          "title": "Robot and Field-Oriented Control",
          "content": "Developed comprehensive control modes including robot-centric control for intuitive driving and field-oriented control for strategic positioning, with seamless switching between control paradigms during operation."
        }
      ],
      "impact": [
        {
          "icon": "🚀",
          "title": "Drivetrain Technology Advancement",
          "content": "Created prototype that significantly advanced team's drivetrain capabilities, enabling more sophisticated robot designs and enhanced competitive performance through superior maneuverability."
        },
        {
          "icon": "🏗️",
          "title": "Engineering Excellence Demonstration",
          "content": "Showcased advanced mechanical engineering and control systems integration, establishing technical leadership and demonstrating mastery of complex robotic systems design."
        },
        {
          "icon": "🗺️",
          "title": "Strategic Competitive Advantage",
          "content": "Provided foundation for superior field positioning and maneuverability that translates directly to competitive advantages in match scenarios and autonomous operation."
        }
      ],
      "challenges": [
        {
          "title": "Mechanical Complexity Management",
          "description": "Designing reliable mechanical systems that coordinate multiple independent modules while maintaining precision, durability, and maintainability under competition conditions."
        },
        {
          "title": "Control Algorithm Development",
          "description": "Implementing sophisticated mathematical models and control algorithms that coordinate four independent swerve modules for smooth, predictable omnidirectional movement."
        },
        {
          "title": "Integration and Optimization",
          "description": "Balancing mechanical design constraints with control system requirements while optimizing for performance, manufacturability, and competitive reliability."
        }
      ],
      "skills_gained": [
        "Advanced CAD modeling and mechanical design",
        "Swerve drive kinematics and control theory",
        "Multi-axis control system development",
        "Robot-centric and field-oriented control algorithms",
        "Mechanical engineering optimization techniques",
        "Prototype development and testing methodologies",
        "Complex system integration and validation"
      ]
    }
  },
  "FRC 2601 - 2K19 Robot, Cygnus": {
    "4_letter": "SH '19",
    "img": "img/projects/sh2k19.jpg",
    "description": "Worked on various software systems with other engineers on the team for FRC Team 2601's 2019 robot.",
    "time": "Jan '19 - Apr '19",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://steelhawks.net/robots",
          "title": "SteelHawks Robots Page",
          "preview": "img/projects/sh2k19.jpg"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Robotics",
      "Software Engineering",
      "Competition"
    ],
    "modal": {
      "detailed_description": "Contributed to the software development for Cygnus, Team 2601 SteelHawks' 2019 competition robot designed for the 'Deep Space' FRC game. This project involved developing control systems for hatch panel and cargo manipulation, as well as climbing mechanisms for the habitat platform. The experience provided foundational knowledge in competitive robotics programming and established patterns for collaborative software development that would support future, more advanced projects.",
      "context": {
        "type": "competition",
        "title": "FRC 2019 'Deep Space' Competition Robot",
        "content": "The 2019 FRC season featured the 'Deep Space' game with space-themed challenges including cargo and hatch panel scoring at multiple levels, plus climbing onto habitat platforms. Cygnus was engineered to excel in this complex game through reliable control systems and strategic mechanism design."
      },
      "technical_details": [
        {
          "icon": "🔧",
          "title": "Game Mechanism Control Systems",
          "content": "Developed control algorithms for cargo intake, hatch panel manipulation, and multi-level scoring systems, ensuring reliable operation during both autonomous and teleoperated periods."
        },
        {
          "icon": "🧧",
          "title": "Climbing System Integration",
          "content": "Implemented software for habitat climbing mechanisms, coordinating multiple actuators and safety systems to achieve reliable end-game performance."
        },
        {
          "icon": "👥",
          "title": "Team Development Practices",
          "content": "Participated in collaborative programming using team development workflows, version control, and systematic testing procedures to ensure code reliability."
        }
      ],
      "impact": [
        {
          "icon": "🏆",
          "title": "Competitive Performance Contribution",
          "content": "Supported successful competition performance through reliable software systems that enabled consistent scoring and strategic gameplay execution."
        },
        {
          "icon": "📚",
          "title": "Foundational Learning Experience",
          "content": "Established fundamental understanding of competitive robotics software architecture that provided the foundation for future leadership roles and advanced projects."
        },
        {
          "icon": "🤝",
          "title": "Collaborative Engineering Excellence",
          "content": "Developed effective teamwork and communication skills essential for complex engineering projects and competitive robotics success."
        }
      ],
      "challenges": [
        {
          "title": "Learning Complex Game Requirements",
          "description": "Understanding and implementing software solutions for the multifaceted challenges of the 'Deep Space' game while learning competitive robotics development practices."
        },
        {
          "title": "Reliable System Integration",
          "description": "Ensuring software systems operated reliably across multiple robot mechanisms while maintaining performance under competition pressure and timing constraints."
        },
        {
          "title": "Team Collaboration Development",
          "description": "Learning to work effectively in a collaborative engineering environment with shared codebases, deadlines, and coordinated development workflows."
        }
      ],
      "skills_gained": [
        "Competitive robotics programming fundamentals",
        "Multi-mechanism control system coordination",
        "Team-based software development workflows",
        "Game strategy implementation in software",
        "Testing and validation procedures for robotics",
        "Problem-solving under competition constraints",
        "Foundation for advanced robotics software architecture"
      ]
    }
  },
  "FRC 2601 - 2K18 Robot, Steel Hawking": {
    "4_letter": "SH '18",
    "img": "img/projects/sh2k18.jpg",
    "description": "Worked on various software systems with other engineers on the team for FRC Team 2601's 2018 robot.",
    "time": "Jan '18 - May '18",
    "media": {
      "images": [],
      "videos": [],
      "websites": [
        {
          "url": "https://steelhawks.net/robots",
          "title": "SteelHawks Robots Page",
          "preview": "img/projects/sh2k18.jpg"
        }
      ]
    },
    "tags": [
      "Control Systems",
      "Robotics",
      "Software Engineering",
      "Competition"
    ],
    "modal": {
      "detailed_description": "Contributed to the software development for Steel Hawking, Team 2601 SteelHawks' 2018 competition robot designed for the 'Power Up' FRC game. This initial foray into competitive robotics programming involved working with experienced team members to develop control systems for cube manipulation, scale balancing, and autonomous routines. The project provided essential introduction to robotics software engineering and established the foundation for future technical leadership and advanced project development.",
      "context": {
        "type": "competition",
        "title": "FRC 2018 'Power Up' - First Competition Experience",
        "content": "The 2018 FRC season featured the 'Power Up' game with arcade-themed challenges including cube placement on scales and switches, plus climbing for power-ups. Steel Hawking represented the beginning of a competitive robotics journey, providing crucial learning experiences in team-based engineering and competition-focused development."
      },
      "technical_details": [
        {
          "icon": "🎮",
          "title": "Basic Control System Implementation",
          "content": "Developed fundamental robot control software for cube manipulation, drivetrain operation, and basic autonomous functions while learning competitive robotics programming practices."
        },
        {
          "icon": "📚",
          "title": "Learning-Focused Development",
          "content": "Focused on understanding robotics software architecture, sensor integration, and control system fundamentals while contributing to team success under mentorship of experienced programmers."
        },
        {
          "icon": "🚀",
          "title": "Foundation Building Experience",
          "content": "Established essential skills in team collaboration, version control, testing procedures, and competition-focused software development that enabled future technical leadership."
        }
      ],
      "impact": [
        {
          "icon": "🌱",
          "title": "Technical Journey Beginning",
          "content": "Launched competitive robotics career and technical development journey that led to leadership roles in subsequent seasons and advanced project development."
        },
        {
          "icon": "🏆",
          "title": "Competition Contribution",
          "content": "Supported team's competitive performance through reliable software contributions and collaborative development practices during rookie programming experience."
        },
        {
          "icon": "🔧",
          "title": "Skills Foundation Establishment",
          "content": "Developed fundamental robotics programming skills and team collaboration practices that enabled future technical innovations and leadership opportunities."
        }
      ],
      "challenges": [
        {
          "title": "Steep Learning Curve",
          "description": "Rapidly acquiring competitive robotics programming skills while contributing meaningfully to team success within the compressed timeline of FRC build season."
        },
        {
          "title": "Complex System Understanding",
          "description": "Learning to work with sophisticated robot systems, sensors, and control algorithms while maintaining code quality and reliability standards."
        },
        {
          "title": "Team Integration and Contribution",
          "description": "Effectively contributing to established team workflows and development practices while building fundamental skills in competitive programming environment."
        }
      ],
      "skills_gained": [
        "Introduction to competitive robotics programming",
        "Basic control systems and sensor integration",
        "Team-based development and collaboration",
        "Competition-focused software engineering practices",
        "Version control and testing fundamentals",
        "Problem-solving in high-pressure environments",
        "Foundation for advanced robotics development"
      ]
    }
  }
}